tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "datawire/blackbird"
tap "denisidoro/tools"
tap "github/gh"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "huytd/cask-fonts"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "muesli/tap"
tap "pokanop/pokanop"
tap "rigellute/tap"
tap "smartlyio/devbox", "https://github.com/smartlyio/homebrew-devbox.git"
tap "universal-ctags/universal-ctags"
tap "wtfutil/wtfutil"
brew "ncurses"
brew "asciiquarium"
brew "aspell"
brew "automake"
brew "bash"
brew "bat"
brew "openjdk"
brew "bfg"
brew "bluetoothconnector"
brew "ghc"
brew "cabal-install"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "ccat"
brew "cliclick"
brew "cmake"
brew "cmatrix"
brew "colormake"
brew "coreutils"
brew "cowsay"
brew "ctags", link: false
brew "ddgr"
brew "deno"
brew "dialog"
brew "diff-so-fancy"
brew "direnv"
brew "docutils"
brew "duti"
brew "editorconfig"
brew "exa"
brew "fasd"
brew "fd"
brew "libtool"
brew "unbound"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fpp"
brew "fselect"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "gcc"
brew "gdk-pixbuf"
brew "gdrive"
brew "gh"
brew "gist"
brew "git"
brew "git-flow-avh"
brew "git-lfs"
brew "git-quick-stats"
brew "git-secrets"
brew "gitleaks"
brew "global"
brew "gnupg", link: false
brew "gpgme"
brew "python@3.8"
brew "gmime"
brew "gnuplot"
brew "go"
brew "librsvg"
brew "graphviz"
brew "grip"
brew "htop"
brew "httpie"
brew "hub"
brew "icdiff"
brew "imagemagick"
brew "imlib2"
brew "ispell"
brew "jq"
brew "krb5"
brew "kubectx"
brew "lazygit"
brew "legit"
brew "less"
brew "libpq"
brew "lolcat"
brew "lsd"
brew "make"
brew "mas"
brew "mdcat"
brew "mdv"
brew "moreutils"
brew "multimarkdown"
brew "n"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "noti"
brew "xapian"
brew "notmuch"
brew "onefetch"
brew "openvpn", restart_service: true
brew "ossp-uuid"
brew "pandoc"
brew "png2ico"
brew "poppler"
brew "postgresql"
brew "pstree"
brew "qt"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "ripgrep-all"
brew "rlwrap"
brew "rust"
brew "shellcheck"
brew "shpotify"
brew "skaffold"
brew "speedtest-cli"
brew "sphinx-doc"
brew "starship"
brew "stern"
brew "stow"
brew "surfraw"
brew "texinfo"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "toilet"
brew "topgrade"
brew "translate-shell"
brew "trash"
brew "travis"
brew "tree"
brew "tty-clock"
brew "um"
brew "urlview"
brew "vault"
brew "vdirsyncer"
brew "vercel-cli"
brew "vim"
brew "vtclock"
brew "w3m"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "yadm"
brew "yarn"
brew "yq"
brew "zlib"
brew "zplug"
brew "zsh"
brew "cloudflare/cloudflare/cloudflared"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-elrumo2-icon", "with-mailutils", "with-xwidgets"]
brew "heroku/brew/heroku"
brew "jesseduffield/lazydocker/lazydocker"
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
brew "koekeishiya/formulae/yabai"
brew "muesli/tap/duf"
brew "rigellute/tap/spotify-tui"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "cheatsheet"
cask "customshortcuts"
cask "dash"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-hasklug-nerd-font"
cask "font-haskplex-nerd"
cask "font-ibm-plex"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-lilex"
cask "font-meslo-for-powerline"
cask "font-monoid-nerd-font"
cask "font-nova-mono"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-nerd-font"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "gpg-suite"
cask "grammarly"
cask "hammerspoon"
cask "image2icon"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keybase"
cask "kindle"
cask "kitty"
cask "messenger"
cask "microsoft-auto-update"
cask "monodraw"
cask "nordvpn"
cask "obsidian"
cask "omnidisksweeper"
cask "osxfuse"
cask "paletro"
cask "pgadmin4"
cask "pop"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "shortcutdetective"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "xquartz"
cask "zoom"
mas "2048 Game", id: 871033113
mas "Amphetamine", id: 937984704
mas "Aviary", id: 1522043420
mas "Bear", id: 1091189122
mas "Bumpr", id: 1166066070
mas "Craft", id: 1487937127
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Dropover", id: 1355679052
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Endel", id: 1484348796
mas "Entity Pro", id: 1503988785
mas "Game Of Life", id: 1377718068
mas "GarageBand", id: 682658836
mas "Gifox", id: 1461845568
mas "GIPHY CAPTURE", id: 668208984
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Marked 2", id: 890031187
mas "Mate Translate", id: 1005088137
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Mockup", id: 1527554407
mas "Momentum", id: 1564329434
mas "MoneyCoach", id: 989642198
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "PopClip", id: 445189367
mas "Reeder", id: 1529448980
mas "ResizeIt", id: 416280139
mas "Rosetta Stone", id: 1476088902
mas "SafariMarkdownLinker", id: 1289119450
mas "Save to Raindrop.io", id: 1549370672
mas "Short Menu", id: 510109287
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "SongPop Party", id: 1551639567
mas "Soulver 3", id: 1508732804
mas "Streaks", id: 1493327990
mas "Taiko no Tatsujin Pop Tap Beat", id: 1463360242
mas "Talon", id: 1492913323
mas "The Pathless", id: 1441675155
mas "TheOregonTrail", id: 1502228492
mas "Toast", id: 1465707487
mas "Twitter", id: 1482454543
mas "URoom", id: 987489616
mas "Vimari", id: 1480933944
mas "Wallpaper Wizard", id: 1266674560
mas "WhatsApp", id: 1147396723
mas "Wonderbox", id: 1520720139
mas "Xcode", id: 497799835
