tap "dopplerhq/cli"
tap "gitguardian/tap"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "shivammathur/php"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Platform built on V8 to build network applications
brew "node"
# Writes your git commit messages for you with AI
brew "aicommits"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Version manager for neovim
brew "bob"
# Draw boxes around text
brew "boxes"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# General-purpose scripting language
brew "php", link: false
# Dependency Manager for PHP
brew "composer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Secure hashing function
brew "libb2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Next-gen compiler infrastructure
brew "llvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rotates, compresses, and mails system logs
brew "logrotate", restart_service: true
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Move files and folders to the trash
brew "macos-trash"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: true
# Mac App Store command-line interface
brew "mas"
# AI on the command-line
brew "mods"
# Remote terminal application
brew "mosh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line and local web note-taking, bookmarking, and archiving
brew "nb"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Trigger notifications when a process completes
brew "noti"
# Tool to manage your Oh Dear sites
brew "ohdear-cli"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# General-purpose scripting language
brew "php@8.2", link: true
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Send emails from your terminal
brew "pop"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew "proctools"
# Emulator for x86 and PowerPC
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command driven spotify player
brew "spotify_player"
# Cross-shell prompt for astronauts
brew "starship"
# Log file highlighter
brew "tailspin"
# Terminal file explorer
brew "tere"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# Detect secrets in source code, scan your repos and docker images for leaks
brew "gitguardian/tap/ggshield"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# General-purpose scripting language
brew "shivammathur/php/php@7.2"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Web browser
cask "firefox"
# Sans-serif typeface
cask "font-geist"
# Monospaced typeface designed to be used where code is represented
cask "font-geist-mono"
# Superfamily of fonts for code
cask "font-monaspace"
# Developer targeted fonts with a high number of glyphs
cask "font-monaspace-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Git client focusing on productivity
cask "gitkraken"
# CLI for GitKraken
cask "gitkraken-cli"
# GPU-based terminal emulator
cask "kitty"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera"
cask "opera-neon"
# WebKit based web browser
cask "orion"
# All-in-one bookmark manager
cask "raindropio"
# Import highlights from Apple Books to Readwise
cask "readwise-ibooks"
# Web browser
cask "sigmaos"
# Tool to simulate responsive designs on multiple devices
cask "sizzy"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "2048 Game", id: 871033113
mas "AngryBirdsReloaded", id: 1539172625
mas "Bear", id: 1091189122
mas "BugHerd", id: 1545845981
mas "Builder's Journey", id: 1466965366
mas "Consent-O-Matic", id: 1606897889
mas "CookingMama Cuisine", id: 1563901930
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Farm It!", id: 1538476446
mas "Ground News", id: 1324203419
mas "Hogwash", id: 1476082027
mas "Hyperspace Desktop", id: 1454139710
mas "iMovie", id: 408981434
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Ivory", id: 6444602274
mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Mercury", id: 1621800675
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Momentum", id: 1564329434
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "OneAuth", id: 1142928979
mas "Pages", id: 409201541
mas "Patty Pursuit", id: 1485030412
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Save to Reader", id: 1640236961
mas "Speed Demons", id: 1476339985
mas "Talon", id: 1492913323
mas "Tureng", id: 854063979
mas "Vimari", id: 1480933944
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "basdp.language-gas-x86"
vscode "bbenoist.Nix"
vscode "beauallison.brew-services"
vscode "bierner.lit-html"
vscode "bmewburn.vscode-intelephense-client"
vscode "boyswan.glsl-literal"
vscode "BRBoer.vsc-conceal"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "colton.inline-html"
vscode "deerawan.vscode-dash"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "Endormi.2077-theme"
vscode "esbenp.prettier-vscode"
vscode "ExodiusStudios.comment-anchors"
vscode "foxundermoon.shell-format"
vscode "GeForceLegend.vscode-glsl"
vscode "Gimly81.fortran"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "guyskk.language-cython"
vscode "hashicorp.terraform"
vscode "idleberg.applescript"
vscode "IHunte.laravel-blade-wrapper"
vscode "jakebathman.mysql-syntax"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-objcpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jonwolfe.language-polymer"
vscode "justusadam.language-haskell"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "ldez.ignore-files"
vscode "magicstack.MagicPython"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mattn.Lisp"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mycelo.embrace"
vscode "naoray.laravel-goto-components"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "patbenatar.advanced-new-file"
vscode "pgl.laravel-jump-controller"
vscode "radium-v.better-less"
vscode "rebornix.prolog"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryannaddy.laravel-artisan"
vscode "sainnhe.everforest"
vscode "scala-lang.scala"
vscode "Shopify.ruby-lsp"
vscode "shufo.vscode-blade-formatter"
vscode "shyykoserhiy.vscode-spotify"
vscode "sidneys1.gitconfig"
vscode "skellock.just"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "stillat-llc.vscode-antlers"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
vscode "whatwedo.twig"
vscode "yatki.vscode-surround"
vscode "yuce.erlang-otp"
vscode "zhuangtongfa.material-theme"
