tap "cormacrelf/tap"
tap "d12frosted/emacs-plus"
tap "dopplerhq/cli"
tap "dzfrias/formulae"
tap "f1bonacc1/tap"
tap "felixkratz/formulae"
tap "gitguardian/tap"
tap "gptscript-ai/tap"
tap "hashicorp/tap"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jfryy/tap"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "kojix2/brew"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
tap "rsteube/tap"
tap "shivammathur/php"
tap "socsieng/tap"
tap "xwmx/taps"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Platform built on V8 to build network applications
brew "node"
# Writes your git commit messages for you with AI
brew "aicommits"
# New file format for still image compression
brew "jpeg-xl"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Version manager for neovim
brew "bob"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Draw boxes around text
brew "boxes"
# New way to see and navigate directory trees
brew "broot"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful command-line bookmark manager
brew "buku"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Core application library for C
brew "glib"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Library for encoding and decoding .avif files
brew "libavif"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Next-gen compiler infrastructure
brew "llvm"
# Command-line csv viewer
brew "csvlens"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Diff that understands syntax
brew "difftastic"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Command-line DNS Client for Humans
brew "doggo"
# Git-powered personal task tracker
brew "dstask"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lua Lisp Language
brew "fennel"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Secure hashing function
brew "libb2"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# AVH edition of git-flow
brew "git-flow-avh"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Spell checker and morphological analyzer
brew "hunspell"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go tool to modify struct field tags
brew "gomodifytags"
# Language server for the Go language
brew "gopls"
# Automatically generate Go test boilerplate from your source code
brew "gotests"
# Library access to GnuPG
brew "gpgme"
# Ping, but with a graph
brew "gping"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive jq
brew "ijq"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive JSON filter using jq
brew "jnv"
# Command-line note taker
brew "jrnl"
# Handy way to save and run project-specific commands
brew "just"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Input filter for the pager less
brew "lesspipe"
# Terminal file manager
brew "lf"
# JIT library for the GNU compiler collection
brew "libgccjit"
# GNOME XML library
brew "libxml2"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rotates, compresses, and mails system logs
brew "logrotate", restart_service: true
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Move files and folders to the trash
brew "macos-trash"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# AI on the command-line
brew "mods"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Remote terminal application
brew "mosh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line and local web note-taking, bookmarking, and archiving
brew "nb"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Trigger notifications when a process completes
brew "noti"
# Modern shell for the GitHub era
brew "nushell"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# General-purpose scripting language
brew "php@8.2"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Send emails from your terminal
brew "pop"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Prettier daemon
brew "prettierd"
# OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew "proctools"
# Command-line tool for managing long-running shell commands
brew "pueue", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# CLI search and replace | Space Age seD
brew "sad"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command driven spotify player
brew "spotify_player"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Log file highlighter
brew "tailspin"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Terminal file explorer
brew "tere"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Programmatically correct mistyped console commands
brew "thefuck"
# CLI csv pretty printer
brew "tidy-viewer"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Manage the desktop wallpaper
brew "wallpaper"
# Execute commands when watched files change
brew "watchexec"
# Lightweight, configurable incoming webhook server
brew "webhook"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-debug", "with-imagemagick", "with-modern-pen-black-icon", "with-native-comp", "with-no-frame-refocus", "with-poll", "with-xwidgets"]
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
brew "f1bonacc1/tap/process-compose"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Detect secrets in source code, scan your repos and docker images for leaks
brew "gitguardian/tap/ggshield"
# GPTScript CLI
brew "gptscript-ai/tap/gptscript"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Multi-tool structured format processor for query and transcoding
brew "jfryy/tap/qq"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# Simple command line tool for DeepL
brew "kojix2/brew/deepl-cli"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# multi-shell multi-command argument completer
brew "rsteube/tap/carapace"
# General-purpose scripting language
brew "shivammathur/php/php@7.2"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# Command-line tool for automating keystrokes and mouse events
brew "socsieng/tap/sendkeys"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Opensource IDE for exploring and testing api's
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Trains AIs to understand and translate texts
cask "deepl"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-fontawesome"
cask "font-geist"
cask "font-geist-mono"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Git client focusing on productivity
cask "gitkraken"
# CLI for GitKraken
cask "gitkraken-cli"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Vector graphics editor
cask "inkscape"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Open source code editor written in Rust
cask "lapce"
# WordPress local development tool by Flywheel
cask "local"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Web browser
cask "microsoft-edge"
# All-in-one calendars, tasks and scheduler
cask "morgen"
# Neovim Client
cask "neovide"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera"
# WebKit based web browser
cask "orion"
# Collaboration platform for API development
cask "postman"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# All-in-one bookmark manager
cask "raindropio"
# Import highlights from Apple Books to Readwise
cask "readwise-ibooks"
# Web browser
cask "sigmaos"
# Tool to simulate responsive designs on multiple devices
cask "sizzy"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Daily planner and calendar
cask "sunsama"
# Search and click text anywhere on screen
cask "superkey"
# To-do list and time tracker
cask "superproductivity"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "2048 Game", id: 871033113
mas "Bear", id: 1091189122
mas "com.kagimacOS.Kagi-Search", id: 1622835804
mas "Consent-O-Matic", id: 1606897889
mas "Developer", id: 640199958
mas "Farm It!", id: 1538476446
mas "Ground News", id: 1324203419
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Mane Merge", id: 1596302742
mas "Mercury", id: 1621800675
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Momentum", id: 1564329434
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "OneAuth", id: 1142928979
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Save to Reader", id: 1640236961
mas "Snake.io+", id: 6443553808
mas "Squiggle Drop", id: 1623460434
mas "Xcode", id: 497799835
mas "Zen Pinball Party", id: 1536783591
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "basdp.language-gas-x86"
vscode "bbenoist.nix"
vscode "beauallison.brew-services"
vscode "bierner.lit-html"
vscode "bmewburn.vscode-intelephense-client"
vscode "boyswan.glsl-literal"
vscode "brboer.vsc-conceal"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "colton.inline-html"
vscode "deerawan.vscode-dash"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "endormi.2077-theme"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "foxundermoon.shell-format"
vscode "geforcelegend.vscode-glsl"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "guyskk.language-cython"
vscode "hashicorp.terraform"
vscode "idleberg.applescript"
vscode "ihunte.laravel-blade-wrapper"
vscode "jakebathman.mysql-syntax"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-objcpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jonwolfe.language-polymer"
vscode "justusadam.language-haskell"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "ldez.ignore-files"
vscode "magicstack.magicpython"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mycelo.embrace"
vscode "naoray.laravel-goto-components"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "patbenatar.advanced-new-file"
vscode "pgl.laravel-jump-controller"
vscode "radium-v.better-less"
vscode "rebornix.prolog"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryannaddy.laravel-artisan"
vscode "sainnhe.everforest"
vscode "scala-lang.scala"
vscode "shopify.ruby-lsp"
vscode "shufo.vscode-blade-formatter"
vscode "shyykoserhiy.vscode-spotify"
vscode "sidneys1.gitconfig"
vscode "skellock.just"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "stillat-llc.vscode-antlers"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "whatwedo.twig"
vscode "yatki.vscode-surround"
vscode "yuce.erlang-otp"
vscode "zhuangtongfa.material-theme"
