tap "charmbracelet/tap"
tap "dopplerhq/cli"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "noborus/tap"
tap "olets/tap"
tap "pokanop/pokanop"
tap "pythops/tenere"
tap "shivammathur/php"
brew "age"
brew "aicommits"
brew "openssl@3"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "atuin"
brew "awk"
brew "bash"
brew "bat"
brew "bats-core"
brew "bfs"
brew "boxes"
brew "broot"
brew "btop"
brew "buku"
brew "cheat"
brew "chezmoi"
brew "libssh2"
brew "curl"
brew "tidy-html5"
brew "php"
brew "composer"
brew "cowsay"
brew "diff-so-fancy"
brew "direnv"
brew "dnsmasq"
brew "duf"
brew "folly"
brew "edencommon"
brew "emscripten"
brew "entr"
brew "exa"
brew "exercism"
brew "expect"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "go"
brew "gum"
brew "howdoi"
brew "htop"
brew "http-prompt"
brew "httpie"
brew "httrack"
brew "imagemagick"
brew "jq"
brew "keychain"
brew "lazydocker"
brew "lazygit"
brew "lefthook"
brew "libmemcached"
brew "lnav"
brew "logrotate", restart_service: true
brew "lolcat"
brew "lsd"
brew "mailhog", restart_service: true
brew "mas"
brew "memcached", restart_service: true
brew "mods"
brew "monolith"
brew "mosh"
brew "most"
brew "mycli"
brew "mysql", restart_service: true
brew "nap"
brew "navi"
brew "nmap"
brew "ripgrep"
brew "nb"
brew "neofetch"
brew "nginx"
brew "nnn"
brew "noti"
brew "tmux"
brew "overmind"
brew "tree"
brew "pass"
brew "php@8.0"
brew "php@8.1"
brew "pinentry-mac"
brew "pipx"
brew "pkg-config"
brew "pstree"
brew "ranger"
brew "rclone"
brew "redis", restart_service: true
brew "ronn"
brew "rsync"
brew "rtorrent"
brew "speedtest-cli"
brew "starship"
brew "subversion"
brew "supervisor"
brew "task"
brew "tasksh"
brew "texinfo"
brew "timewarrior"
brew "tldr"
brew "trash"
brew "watchman"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh-lovers"
brew "dopplerhq/cli/doppler", link: false
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "koekeishiya/formulae/skhd"
brew "noahgorstein/tap/jqp"
brew "noborus/tap/ov"
brew "shivammathur/php/php@7.2"
cask "1password-cli"
cask "alacritty"
cask "arc"
cask "chromedriver"
cask "chromium"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "element"
cask "figma"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "helo"
cask "httpie"
cask "insomnia"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "key-codes"
cask "keybase"
cask "kindle"
cask "loom"
cask "morgen"
cask "mullvadvpn"
cask "ngrok"
cask "nordvpn"
cask "openvpn-connect"
cask "parallels"
cask "ray"
cask "scrolla"
cask "shortcat"
cask "shortcutdetective"
cask "sitesucker-pro"
cask "slack"
cask "spotify"
cask "surfshark"
cask "telegram"
cask "termius"
cask "tinkerwell"
cask "transmission"
cask "transmit"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"
cask "witch"
cask "wooshy"
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "2048 Game", id: 871033113
mas "Bear", id: 1091189122
mas "Builder's Journey", id: 1466965366
mas "Consent-O-Matic", id: 1606897889
mas "CookingMama Cuisine", id: 1563901930
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Farm It!", id: 1538476446
mas "GarageBand", id: 682658836
mas "Ground News", id: 1324203419
mas "Hogwash", id: 1476082027
mas "Hyperspace Desktop", id: 1454139710
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mercury", id: 1621800675
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Momentum", id: 1564329434
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "OneAuth", id: 1142928979
mas "Pages", id: 409201541
mas "Patty Pursuit", id: 1485030412
mas "Pixelmator Pro", id: 1289583905
mas "Talon", id: 1492913323
mas "Tureng", id: 854063979
mas "Vimari", id: 1480933944
vscode "2ndshift.fresh-material"
vscode "aaron-bond.better-comments"
vscode "adrolli.tallui-laravel-livewire-tailwind"
vscode "ahinkle.laravel-model-snippets"
vscode "akamud.vscode-caniuse"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alekangelov.alek-kai-theme"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "amodio.amethyst-theme"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ardisaurus.gitflow-actions-sidebar"
vscode "astro-build.astro-vscode"
vscode "atomiks.moonlight"
vscode "austenc.laravel-blade-spacer"
vscode "austenc.laravel-docs"
vscode "austenc.livewire-docs"
vscode "austenc.statamic-docs"
vscode "austenc.tailwind-docs"
vscode "bebo925.livewire-switcher"
vscode "beyondcode.tinkerwell"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "Catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "cierra.livewire-vscode"
vscode "cjhowe7.laravel-blade"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "dannyconnell.split-html-attributes"
vscode "DanSarich.lovelace-theme"
vscode "dansysanalyst.pest-snippets"
vscode "Dart-Code.dart-code"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "deerawan.vscode-faker"
vscode "dermohamad.ayu-owl"
vscode "DEVSENSE.composer-php-vscode"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "foxundermoon.shell-format"
vscode "genieai.chatgpt-vscode"
vscode "getpsalm.psalm-vscode-plugin"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "GulajavaMinistudio.mayukaithemevsc"
vscode "hakcorp.php-awesome-snippets"
vscode "hashicorp.terraform"
vscode "heybourn.headwind"
vscode "hilleer.yaml-plus-json"
vscode "HubSpot.hubl"
vscode "huytd.nord-light"
vscode "IBM.output-colorizer"
vscode "IHunte.laravel-blade-wrapper"
vscode "inci-august.august-themes"
vscode "ivhernandez.vscode-plist"
vscode "jakearl.search-editor-apply-changes"
vscode "jccr.sandbox"
vscode "jock.svg"
vscode "kamikillerto.vscode-colorize"
vscode "Kasik96.latte"
vscode "kokororin.vscode-phpfmt"
vscode "krueger71.crt-themes"
vscode "linyang95.php-symbols"
vscode "MehediDracula.php-constructor"
vscode "MehediDracula.php-namespace-resolver"
vscode "melishev.feather-vscode"
vscode "meronz.manpages"
vscode "mightbesimon.emoji-icons"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "naoray.laravel-goto-components"
vscode "neilbrayfield.php-docblocker"
vscode "octref.vetur"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "open-southeners.laravel-pint"
vscode "patbenatar.advanced-new-file"
vscode "pcbowers.alpine-intellisense"
vscode "Perkovec.emoji"
vscode "pgl.laravel-jump-controller"
vscode "phproberto.vscode-php-getters-setters"
vscode "PKief.material-icon-theme"
vscode "qinjia.seti-icons"
vscode "rahmanyerli.ra-spring"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "sainnhe.everforest"
vscode "SanderRonde.phpstan-vscode"
vscode "sdras.night-owl"
vscode "sevavietl.php-files"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shufo.vscode-blade-formatter"
vscode "sianglim.slim"
vscode "sleistner.vscode-fileutils"
vscode "stillat-llc.vscode-antlers"
vscode "sumneko.lua"
vscode "swordev.phpstan"
vscode "tal7aouy.icons"
vscode "teabyii.ayu"
vscode "valeryanm.vscode-phpsab"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "wingrunr21.vscode-ruby"
vscode "wk-j.save-and-run"
vscode "xdebug.php-debug"
vscode "Youssef.viow"
vscode "zhuangtongfa.material-theme"
