tap "d12frosted/emacs-plus"
tap "datawire/blackbird"
tap "denisidoro/tools"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "huytd/cask-fonts"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "pokanop/pokanop"
tap "rigellute/tap"
tap "smartlyio/devbox", "https://github.com/smartlyio/homebrew-devbox.git"
tap "universal-ctags/universal-ctags"
tap "wtfutil/wtfutil"
cask "osxfuse"
cask "xquartz"
brew "asciiquarium"
brew "automake"
brew "bash"
brew "bat"
brew "bfg"
brew "ccat"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "ddgr"
brew "deno"
brew "dialog"
brew "diff-so-fancy"
brew "direnv"
brew "duti"
brew "editorconfig"
brew "exa"
brew "fasd"
brew "fd"
brew "pkg-config"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gdrive"
brew "gh"
brew "gist"
brew "git"
brew "git-flow-avh"
brew "git-lfs"
brew "git-quick-stats"
brew "git-secrets"
brew "gitleaks"
brew "global"
brew "go"
brew "grip"
brew "htop"
brew "hub"
brew "ispell"
brew "jq"
brew "legit"
brew "less"
brew "libvterm"
brew "lolcat"
brew "lsd"
brew "make"
brew "mas"
brew "mdcat"
brew "mdv"
brew "multimarkdown"
brew "n"
brew "neovim"
brew "nodenv"
brew "noti"
brew "onefetch"
brew "openvpn", restart_service: true
brew "ossp-uuid"
brew "pandoc"
brew "png2ico"
brew "poppler"
brew "ranger"
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "shpotify"
brew "speedtest-cli"
brew "stow"
brew "surfraw"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "toilet"
brew "topgrade"
brew "translate-shell"
brew "trash"
brew "travis"
brew "tree"
brew "tty-clock"
brew "um"
brew "urlview"
brew "vault"
brew "vdirsyncer"
brew "vim"
brew "vtclock"
brew "w3m"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zplug"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-modern-sjrmanning-icon"]
brew "heroku/brew/heroku"
brew "jesseduffield/lazydocker/lazydocker"
brew "rigellute/tap/spotify-tui"
brew "smartlyio/devbox/devbox"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airtable"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "caprine"
cask "cheatsheet"
cask "customshortcuts"
cask "dash"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-daddy-time-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-haskplex-nerd"
cask "font-im-writing-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "franz"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "grammarly"
cask "graphql-playground"
cask "hammerspoon"
cask "image2icon"
cask "insomnia"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keybase"
cask "keycue"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mongotron"
cask "monodraw"
cask "netnewswire"
cask "nordvpn"
cask "notion"
cask "now"
cask "omnidisksweeper"
cask "paletro"
cask "pgadmin4"
cask "qutebrowser"
cask "raindropio"
cask "rectangle"
cask "robo-3t"
cask "sequel-pro"
cask "sketch"
cask "spectacle"
cask "spotify"
cask "textexpander"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "zoomus"
mas "2048 Game", id: 871033113
mas "Airmail", id: 918858936
mas "Alto's Adventure", id: 1287752517
mas "Alto's Odyssey", id: 1495097700
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bumpr", id: 1166066070
mas "CARROT Weather", id: 993487541
mas "com.blindflugstudios.stellarcommandersOSX", id: 1469802512
mas "Dato", id: 1470584107
mas "Day One", id: 1055511498
mas "Dear Reader", id: 1475303629
mas "Developer", id: 640199958
mas "Don't Bug Me!", id: 1461998483
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Honey", id: 1472777122
mas "iMovie", id: 408981434
mas "Instapaper", id: 1481302432
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "Lifeslide", id: 1472966601
mas "Marked 2", id: 890031187
mas "Mate Translate", id: 1005088137
mas "MindNode", id: 1289197285
mas "Mini Motorways", id: 1456188526
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "OmniFocus", id: 1346203938
mas "Pages", id: 409201541
mas "PaintyMob", id: 1476276168
mas "Paletter", id: 1494948845
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Patterned", id: 1451427346
mas "PhotoScissors", id: 1499327097
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "Pocket", id: 568494494
mas "PopClip", id: 445189367
mas "Raindrop.io for Safari", id: 957810159
mas "Reeder", id: 1449412482
mas "Relax Melodies", id: 467103113
mas "ResizeIt", id: 416280139
mas "Rosetta Stone", id: 1476088902
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "Soulver 3", id: 1508732804
mas "Spark", id: 1176895641
mas "Talon", id: 1492913323
mas "Things", id: 904280696
mas "Time Out", id: 402592703
mas "tint.", id: 1464860034
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "Wallpaper Wizard", id: 1266674560
mas "WCF", id: 1466835143
mas "WhatsApp", id: 1147396723
mas "Word Laces", id: 1445098386
mas "Xcode", id: 497799835
mas "Zen Coloring Book For Adults", id: 1063659855
