tap "abhimanyu003/sttr"
tap "achannarasappa/tap"
tap "alajmo/sake"
tap "arl/arl"
tap "cormacrelf/tap"
tap "d12frosted/emacs-plus"
tap "dnote/dnote"
tap "dopplerhq/cli"
tap "dzfrias/formulae"
tap "f1bonacc1/tap"
tap "felixkratz/formulae"
tap "gitguardian/tap"
tap "goreleaser/tap"
tap "gptscript-ai/tap"
tap "hashicorp/tap"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jfryy/tap"
tap "johanneskaufmann/tap"
tap "jorgerojas26/lazysql"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "kojix2/brew"
tap "lucaspickering/tap"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
tap "rsteube/tap"
tap "shivammathur/php"
tap "skatkov/tap"
tap "socsieng/tap"
tap "timothyye/tap"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
tap "xwmx/taps"
brew "age"
brew "libpng"
brew "jpeg-xl"
brew "asdf"
brew "atuin"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bat"
brew "gmp"
brew "bats-core"
brew "bison"
brew "bob"
brew "broot"
brew "btop"
brew "freetype"
brew "gettext"
brew "glib"
brew "cbonsai"
brew "harfbuzz"
brew "icu4c@76"
brew "libavif"
brew "pango"
brew "librsvg"
brew "chafa"
brew "cheat"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "gd"
brew "krb5"
brew "libsodium"
brew "libzip"
brew "php"
brew "composer"
brew "cowsay"
brew "pkgconf"
brew "dark-mode"
brew "direnv"
brew "dnsmasq", restart_service: :changed
brew "docker", link: false
brew "doggo"
brew "duf"
brew "duti"
brew "elvish"
brew "eza"
brew "fd"
brew "openjpeg"
brew "libb2"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "fortune"
brew "fzf"
brew "gcc"
brew "ggshield"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow-avh"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "hunspell"
brew "qt"
brew "gnuplot"
brew "gping"
brew "graphviz"
brew "grep"
brew "gzip"
brew "himalaya"
brew "htop"
brew "httpie", link: false
brew "iftop"
brew "jq"
brew "ijq"
brew "libheif"
brew "imagemagick"
brew "jd"
brew "jpeg"
brew "jrnl"
brew "node"
brew "jupyterlab"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lesspipe"
brew "lf"
brew "libedit"
brew "libgccjit"
brew "libiconv"
brew "libsixel"
brew "libxml2"
brew "lnav"
brew "logrotate"
brew "lolcat"
brew "lorem"
brew "luarocks"
brew "lynx"
brew "mariadb"
brew "mas"
brew "mdbook"
brew "mosh"
brew "yt-dlp"
brew "mpv"
brew "zlib"
brew "mysql", restart_service: :changed, link: false
brew "mysql@8.4"
brew "neofetch"
brew "newsboat"
brew "nginx"
brew "noti"
brew "numpy"
brew "nushell"
brew "openvino"
brew "tmux"
brew "overmind"
brew "p7zip"
brew "php@8.2"
brew "php@8.3"
brew "pinentry-mac"
brew "pnpm"
brew "poppler"
brew "procs"
brew "proctools"
brew "pueue", restart_service: :changed
brew "python@3.11"
brew "qemu"
brew "re2c"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rsync"
brew "sc-im"
brew "sd"
brew "sevenzip"
brew "sl"
brew "sniffnet"
brew "speedtest-cli"
brew "spicetify-cli"
brew "spotify_player"
brew "ssh-copy-id"
brew "starship"
brew "tabiew"
brew "task"
brew "tasksh"
brew "taskwarrior-tui"
brew "television"
brew "terraform"
brew "tidy-viewer", link: false
brew "tig"
brew "timewarrior"
brew "tmuxp"
brew "tree"
brew "ugrep"
brew "unar"
brew "unison"
brew "vim"
brew "vit"
brew "viu"
brew "vivid", link: false
brew "w3m"
brew "watchexec"
brew "webhook"
brew "wget"
brew "xidel"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-lovers"
brew "arl/arl/gitmux"
brew "cormacrelf/tap/dark-notify"
brew "dnote/dnote/dnote"
brew "dopplerhq/cli/doppler", link: false
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "gptscript-ai/tap/gptscript"
brew "johanneskaufmann/tap/html2markdown"
brew "morantron/tmux-fingers/tmux-fingers"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.3"
brew "shivammathur/php/php@7.4"
brew "skatkov/tap/poshtui"
brew "socsieng/tap/sendkeys"
brew "timothyye/tap/skm"
cask "1password-cli"
cask "aerospace"
cask "affinity-designer"
cask "betterdisplay"
cask "bruno"
cask "chatgpt"
cask "chromedriver"
cask "chromium"
cask "claude"
cask "deepl"
cask "docker"
cask "figma"
cask "firefox"
cask "floorp"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "hashicorp-vagrant"
cask "herd"
cask "hoppscotch"
cask "httpie"
cask "kando"
cask "karabiner-elements"
cask "kitty"
cask "libreoffice"
cask "mactex"
cask "messenger"
cask "microsoft-edge"
cask "min"
cask "mouseless@preview"
cask "neovide"
cask "netron"
cask "ngrok"
cask "obsidian"
cask "orion"
cask "qutebrowser"
cask "raindropio"
cask "scrolla"
cask "shortcat"
cask "signal"
cask "stats"
cask "tailscale"
cask "telegram"
cask "utm"
cask "virtualbox"
cask "vivaldi"
cask "vivid"
cask "wakatime"
cask "wave"
cask "wezterm"
cask "whatsapp"
cask "wooshy"
cask "zen-browser"
mas "1Password for Safari", id: 1569813296
mas "Adventures", id: 6444109249
mas "Bear", id: 1091189122
mas "Consent-O-Matic", id: 1606897889
mas "Developer", id: 640199958
mas "Endel", id: 1346247457
mas "Ground News", id: 1324203419
mas "Home Assistant", id: 1099568401
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Momentum", id: 1564329434
mas "My Bowling 3D", id: 1603983702
mas "Numbers", id: 409203825
mas "OneAuth", id: 1142928979
mas "Pages", id: 409201541
mas "Patty Pursuit", id: 1485030412
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Snake.io+", id: 6443553808
mas "Squiggle Drop", id: 1623460434
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
mas "Zen Pinball Party", id: 1536783591
