tap "adembc/tap"
tap "charmbracelet/tap"
tap "cormacrelf/tap"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "homebrew/core"
tap "ksdme/tap"
tap "nikitabobko/tap"
tap "shivammathur/php"
tap "valkyrie00/bbrew"
# Text editor for your terminal
brew "amp"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Draw boxes around text
brew "boxes"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Multi-shell multi-command argument completer
brew "carapace"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Graphics library to dynamically manipulate images
brew "gd"
# Implements SNMP v1, v2c, and v3, using IPv4 and IPv6
brew "net-snmp"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Portable file server
brew "copyparty"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Lightweight and powerful workflow engine
brew "dagu", restart_service: :changed
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: :changed
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Command-line DNS Client for Humans
brew "doggo"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Log analysis TUI
brew "gonzo"
# Ping, but with a graph
brew "gping"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Fast and powerful log viewer and processor
brew "hl"
# Git-compatible distributed version control system
brew "jj"
# TUI for interacting with the Jujutsu version control system
brew "jjui"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Rainbows and unicorns in your console!
brew "lolcat"
# Fast, minimalist directory tree viewer
brew "lstr"
# Package manager for the Lua programming language
brew "luarocks"
# Drop-in replacement for MySQL
brew "mariadb", link: false
# Syntax-aware git merge driver
brew "mergiraf"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc", link: false
# AI on the command-line
brew "mods"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Network scanner with features like WiFi scanning, packetdump and more
brew "netscanner"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: :changed
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# Modern shell for the GitHub era
brew "nushell"
# General-purpose scripting language
brew "php@8.2"
# General-purpose scripting language
brew "php@8.3"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Command-line tool for managing long-running shell commands
brew "pueue", restart_service: :changed
# Generic machine emulator and virtualizer
brew "qemu"
# Fast, stateless LLM for your shell: qq answers; qa runs commands
brew "qqqa"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command driven spotify player
brew "spotify_player"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Process Control System
brew "supervisor", restart_service: :changed
# Open source continuous file synchronization application
brew "syncthing"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Modern reverse proxy
brew "traefik"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Terminal navigator
brew "walk"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Zsh plugin manager
brew "zimfw"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A simple terminal UI for managing SSH connections.  
brew "adembc/tap/lazyssh"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler", link: false
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A utility toolkit of most commonly used tools by software developers and IT professionals
brew "ksdme/tap/ut"
# A simple TUI tool to make your homebrew bold.
brew "valkyrie00/bbrew/bbrew"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Runbook editor for terminal workflows
cask "atuin-desktop"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop client for brain.fm
cask "brainfm"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Create dynamic wallpapers
cask "equinox"
# Email client
cask "fastmail"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Privacy-focused Firefox-based browser
cask "floorp"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-adwaita-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-maple-mono-nf"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-myna"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Chromium-based web browser
cask "helium-browser"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Code notebooks for Elixir developers
cask "livebook"
# Visual diff and merge tool
cask "meld"
# Mouse control with the keyboard
cask "mouseless"
# Neovim Client
cask "neovide-app"
# Control your tools with a few keystrokes
cask "raycast"
# Hardware-accelerated GPU terminal emulator
cask "rio"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Native desktop client for WhatsApp
cask "whatsapp"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
go "cmd/go"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
