tap "felixkratz/formulae"
tap "homebrew/core"
tap "nikitabobko/tap"
tap "valkyrie00/bbrew"
brew "atuin", restart_service: :changed
brew "bash"
brew "chezmoi"
brew "php"
brew "composer"
brew "dark-mode"
brew "dnsmasq", restart_service: :changed
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gnupg"
brew "lazygit"
brew "less"
brew "nginx"
brew "nushell"
brew "pinentry-mac"
brew "pueue", restart_service: :changed
brew "ripgrep"
brew "ruby"
brew "rust"
brew "spotify_player"
brew "starship"
brew "vivid"
brew "wget"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "valkyrie00/bbrew/bbrew"
cask "aerospace"
cask "figma"
cask "firefox"
cask "floorp"
cask "font-atkynson-mono-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "raycast"
cask "signal"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "vivaldi"
cask "wezterm@nightly"
cask "whatsapp"
cask "zoom"
